/**
 * Created by Rajesh on 1/8/18.
 */

const initialState = {
    items : [
        {
            id: 1,
            title: 'পিপীলিকা সম্পর্কে',
            image: null,
            url: 'about',
            subtitle: 'পিঁপড়া বা পিঁপড়ে বা পিপীলিকা, এক প্রকার সামাজিক কীট বা পোকা',
            content: `
                    <p>পিঁপড়া বা পিঁপড়ে বা পিপীলিকা হল ফর্মিসিডি (Formicidae) গোত্রের অন্তর্গত সামাজিক কীট বা পোকা। পিঁপড়া এদের ঘনিষ্ঠ প্রজাতি বোলতা ও মৌমাছির মত একই বর্গ হাইমেনপ্টেরার (Hymenoptera) অন্তর্গত। এরা মধ্য-ক্রেটাশাস
                        পর্যায়ে ১১ থেকে ১৩ কোটি বছর পূর্বে বোলতা জাতীয় প্রাণী হতে বিবর্তিত হয় এবং সপুষ্পক উদ্ভিদের উদ্ভবের পর বহুমুখী বিকাশ লাভ করে। এখন পর্যন্ত জানা প্রায় ২২,০০০ পিঁপড়া প্রজাতির মধ্যে ১২,৫০০ টির শ্রেণিবিন্যাস করা হয়েছে।
                        কনুই-সদৃশ শুঙ্গ এবং গ্রন্থির মত যে কাঠামো দিয়ে তার সরু কোমড় গঠিত হয় তার মাধ্যমে </p>

                        <p>পিঁপড়া উপনিবেশ তৈরি করে বাস করে যা প্রাকৃতিক ভাবে সৃষ্টি হওয়া কয়েক ডজন শিকারী পিঁপড়া থেকে শুরু করে বিশাল এলাকাজুড়ে বাস করা লক্ষ লক্ষ পিঁপড়ার সমন্বয়ে গঠিত হতে পারে। বড় দলগুলি প্রধানত অনুর্বর নারী পিঁপড়াদের সমন্বয়ে তৈরি
                            হয় যারা কর্মী, সৈন্য এবং অন্যান্য বিশেষায়িত বাহিনীতে বিভক্ত থাকে। প্রায় সব পিঁপড়ার উপনিবেশেই কিছু প্রজননক্ষম পুরুষ পিঁপড়া (ড্রোন) এবং এক বা একাধিক উর্বর নারী পিঁপড়া থাকে, যাদের রাণী পিঁপড়া বলা হয়।</p>
                            
                        <p>পৃথিবীর প্রায় সর্বত্র পিঁপড়ার দেখা মেলে, একমাত্র এন্টার্কটিকা ও এ ধরণের কিছু এলাকা ছাড়া। পিঁপড়া প্রায় যেকোনো বাস্তুসংস্থানে বিকাশ লাভ করতে পারে এবং এরা ভূমিগত বায়োমাসের প্রায় ১৫-২৫% গঠন করে। তাদের এই সাফল্যের কারণ হল তাদের সামাজিক সংগঠন, দ্রুত বাসস্থান পরিবর্তনের ক্ষমতা, রসদ জোগাড় করার দক্ষতা এবং নিজেদের রক্ষা করার পারদর্শিতা।
                         অন্য প্রাণীদের সাথে তাদের দীর্ঘ দিনের সহবিবর্তন mimetic, পরাশ্রয়ী, পরজীবী এবং মিথোজোবী সম্পর্কের পত্তন ঘটিয়েছে।</p>

                       <p>পিপীলিকা সমাজে শ্রমবিভাগ, ব্যক্তিগত পর্যায়ে যোগাযোগ এবং জটিল সমস্যা সমাধানের দক্ষতা রয়েছে। মানুষের সাথে এই সাযুজ্যগুলো তাদেরকে গবেষণার জন্য খুব আকর্ষণীয় প্রাণী করে তুলেছে। অনেক মানব সমাজে আবার পিঁপড়াকে খাদ্য, ঔষধ এবং ধর্মীয় আচার-অনুষ্ঠানে ব্যবহার করা হয়। পিঁপড়ার কিছু প্রজাতি জৈব কীটনাশক হিসেবেও গুরত্বপূর্ণ। তবে পিঁপড়া মানুষের জন্যে মাঝে মাঝে ক্ষতিরও কারণ হয়ে দাঁড়াতে পারে। পিঁপড়া ফসলের ক্ষতি করে এবং দালান-কোঠার ধ্বংস সাধন করে। 
                       এর কিছু প্রজাতি যেমন Red imported fire ant কে কোথাও কোথাও আগ্রাসী প্রজাতি হিসেবে বিবেচনা করা হয়। কারণ এরা ঘটনাচক্রে নতুন কোন পরিবেশে গিয়ে পড়লেও খুব সহজে সেখানে নিজেদের সুপ্রতিষ্ঠিত করে নিতে পারে।</p>


                        <h4>শ্রেণিবিন্যাস ও বিবর্তন</h4>

                        <p>ফর্মিসিডি পরিবারটি হাইমেনপ্টেরা বর্গের অন্তর্ভুক্ত যে বর্গের মধ্যে পিঁপড়া ছাড়াও রয়েছে মৌমাছি, বোলতা এবং সফ্লাই। ভেসপয়েড বোলতাদের একটি বংশধারা থেকে পিঁপড়াদের বিবর্তন ঘটেছে। জীবাশ্মের রেকর্ড থেকে জানা গেছে ১৫ কোটি বছর পূর্বে
                            অর্থাৎ জুরাসিক যুগের শেষদিকেও তাদের অস্তিত্ব ছিল। ১০ কোটি বছর পূর্বে সপুষ্পক উদ্ভিদের বিকাশের পর তারা আরও বৈচিত্র্যময় হয়ে ওঠে এবং আনুমানিক ৬ কোটি বছর পূর্বে বাস্তুতান্ত্রিক প্রতিপত্তি অর্জন করে।[৬] ১৯৬৬ সালে ই ও উইলসন
                            ও তার সহকর্মীরা অ্যাম্বারে ফাঁদে আটকে পড়া ক্রিটেশাস যুগের একটি পিঁপড়ার জীবাশ্ম আবিষ্কার করেন যার প্রজাতির নাম Sphecomyrma freyi. ৮ কোটি বছরের পুরনো এই জীবাশ্মটিতে পিঁপড়া ও বোলতা উভয়ের বৈশিষ্ট্যই পাওয়া যায়।[৭]
                            স্ফেকোমারমা সম্ভবত ভূপৃষ্ঠে বসবাসকারী সংগ্রাহক ছিল, অনেকে অবশ্য মনে করেন Leptanillinae এবং Martialinae শ্রেণীর প্রাণীদের মত প্রাচীন পিঁপড়ারা মাটির নিচে শিকার করে খেতো।</p>`
        },
        {
            id: 2,
            title: 'পিপীলিকা কী?',
            image: null,
            url: 'what',
            subtitle: 'বাংলাদেশের প্রথম ও পূর্নাঙ্গ সার্চ ইঞ্জিন',
            content: `
                    <p>
                    পিপীলিকা বাংলাদেশের প্রথম এবং একমাত্র অনুসন্ধান ইঞ্জিন যা বাংলা ও ইংরেজী দুই ভাষাতেই কাজ করতে সক্ষম। এই উন্মুক্ত ওয়েব সার্ভিসটি সারা দেশের তথ্য অনুসন্ধান করতে সহায়তা করে। এটি দেশের প্রধান বাংলা ও ইংরেজী পত্রিকার সংবাদ, বাংলা ব্লগ, বাংলা উইকিপিডিয়া ও সরকারি তথ্য স্বয়ংক্রিয়ভাবে বিশ্লেষণ ও সংরক্ষণ করে। পিপীলিকাতে বাংলা তথ্য বিশ্লেষণ ও অনুসন্ধানের উপর গুরুত্ব দেয়ার চেষ্টা করা হয়েছে।
                    `
        }
    ],
    error: null
};

export default function reducer(state = initialState, action) {
    return state;
}
